#!/bin/bash

printf "%-10s %-8s %-4s\n" 姓名 性别 体重kg   #姓名     性别   体重kg

printf "%-10s %-8s %-4.2f\n" 郭靖 男 66.1234   #郭靖     男      66.12

:<<EOF
%s %c %d %f都是格式替代符

%-10s 指一个宽度为10个字符（-表示左对齐，没有则表示右对齐），任何字符都会被显示在10个字符宽的字符内，如果不足则自动以空格填充，超过也会将内容全部显示出来。

%-4.2f 指格式化为小数，其中.2指保留2位小数。
EOF


printf "%d %s\n" 1 "abc"   # 1 abc      单双引号、无引号都一样

printf "%s\\"  abc def   # abc\def\    format-string 被重用

printf "%s and %d \n"  # and 0    如果没有 arguments，那么 %s 用NULL代替，%d 用 0 代替



:<<EOF
%d %s %c %f 格式替代符详解:

d: Decimal 十进制整数 -- 对应位置参数必须是十进制整数，否则报错！

s: String 字符串 -- 对应位置参数必须是字符串或者字符型，否则报错！

c: Char 字符 -- 对应位置参数必须是字符串或者字符型，否则报错！

f: Float 浮点 -- 对应位置参数必须是数字型，否则报错！
EOF

printf "%d %s %c\n" 1 "abc" "def"  #1 abc d     %c 自动截取字符串的第一个字符作为结果输出





:<<EOF
\a	警告字符，通常为ASCII的BEL字符
\b	后退
\c	抑制（不显示）输出结果中任何结尾的换行字符（只在%b格式指示符控制下的参数字符串中有效），而且，任何留在参数里的字符、任何接下来的参数以及任何留在格式字符串中的字符，都被忽略
\f	换页（formfeed）
\n	换行
\r	回车（Carriage return）
\t	水平制表符
\v	垂直制表符
\\	一个字面上的反斜杠字符
\ddd	表示1到3位数八进制值的字符。仅在格式字符串中有效
\0ddd	表示1到3位的八进制值字符
EOF



